<?php
// +----------------------------------------------------------------------
// | author     王杰
// +----------------------------------------------------------------------
// | time       2016-11-01
// +----------------------------------------------------------------------
// | version    3.0.1
// +----------------------------------------------------------------------
// | introduce  错误信息
// +----------------------------------------------------------------------

defined('ACC')||exit('ACC Denied');
return array(

		'token'=>array(200,'token丢失'),
		'success'=>array(100,'操作成功'),

		'phone'=>array(10001,'请输入正确的手机号码'),
		'password'=>array(10002,'密码不能少于6位，多于16位'),
		'login'=>array(10003,'登录失败，账户或者密码错误'),
		'havuse'=>array(10004,'当前账户已注册'),
		'username'=>array(10005,'用户名不能少于2位，大于6位'),
		'name'=>array(10006,'姓名不能少于2位，大于6位'),
		'code'=>array(10007,'验证码错误'),
		'usermiss'=>array(10009,'帐号不存在'),

		'paramMiss'=>array(20001,'缺少参数'),
		'msgapierror'=>array(20002,'短信接口返回失败'),
		'msgerror'=>array(20003,'短信未验证，30分钟有效'),
		'phonecodeerror'=>array(20004,'短信验证失败'),

		'fileMax'=>array(30001,'上传文件超出大小限制'),
		'fileType'=>array(30002,'上传文件类型不对'),
		'fileFail'=>array(30003,'上传文件失败'),
		'fileNo'=>array(30004,'没找到上传文件'),


		'cardhad'=>array(10008,'银行卡已存在，请勿重复提交'),
		'card'=>array(10010,'身份证验证错误'),
		'cardHad'=>array(10011,'当前身份已认证'),
		'nopay'=>array(10012,'当前用户未身份认证，无法购买'),



	);