<?php
// +----------------------------------------------------------------------
// | author     王杰
// +----------------------------------------------------------------------
// | time       2016-11-01
// +----------------------------------------------------------------------
// | version    3.0.1
// +----------------------------------------------------------------------
// | introduce  错误信息
// +----------------------------------------------------------------------

defined('ACC')||exit('ACC Denied');
return [

		'token'=>[200,'token丢失'],
		'success'=>[100,'操作成功'],

		'phone'=>[10001,'请输入正确的手机号码'],
		'password'=>[10002,'密码不能少于6位，多于16位'],
		'login'=>[10003,'登录失败，账户或者密码错误'],
		'havuse'=>[10004,'当前账户已注册'],
		'username'=>[10005,'用户名不能少于2位，大于6位'],
		'name'=>[10006,'姓名不能少于2位，大于6位'],
		'code'=>[10007,'验证码错误'],
		'usermiss'=>[10009,'帐号不存在'],
		'passwordError'=>[10010,'原密码错误'],

		'paramMiss'=>[10100,'缺少参数'],
		'typeError'=>[10101,'类型错误'],
		'jurisdic'=>[10102,'权限不够'],
		'paramError'=>[10103,'参数错误'],

		'msgapierror'=>[20002,'短信接口返回失败'],
		'msgerror'=>[20003,'短信未验证，30分钟有效'],
		'phonecodeerror'=>[20004,'短信验证失败'],

		'fileMax'=>[30001,'上传文件超出大小限制'],
		'fileType'=>[30002,'上传文件类型不对'],
		'fileFail'=>[30003,'上传文件失败'],
		'fileNo'=>[30004,'没找到上传文件'],

		'content'=>[40001,'帖子内容不能为空'],
		'invitaMiss'=>[40002,'帖子丢失'],

		'authen'=>[50001,'还没有进行教师认证，不能进行相关操作'],

		'groupName'=>[50100,'分组名称不能少于一位，大于二十位'],
		'groupExits'=>[50101,'分组已经存在'],
		'groupSystem'=>[50102,'系统分组不能删除'],
		'groupNull'=>[50103,'分组不存在'],
		'groupError'=>[50104,'当前分组不能修改'],

		'friendExits'=>[50201,'已经是好友了'],
		'addFrinds'=>[50202,'已经发出好友申请，请等待'],
		'selfError'=>[50203,'不能添加自己为好友'],
		'addMsg'=>[50204,'对方已经发出申请，请确认'],
		'addMsgError'=>[50205,'没有该好友申请'],
		'checkSure'=>[50206,'已经确认好友申请，请勿重复操作'],

		'tribeExits'=>[50301,'部落已经存在'],
		'tribeName'=>[50302,'部落名称不能少于两位，大于十位'],

];